In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame({'Col1': [10, 20, 15, 30, 45],
                    'Col2': [13, 23, 18, 33, 48],
                    'Col3': [17, 27, 22, 37, 52]})

In [8]:
df.shift(-1)

   Col1  Col2  Col3
0  20.0  23.0  27.0
1  15.0  18.0  22.0
2  30.0  33.0  37.0
3  45.0  48.0  52.0
4   NaN   NaN   NaN

In [5]:
df.shift(1)

   Col1  Col2  Col3
0   NaN   NaN   NaN
1  10.0  13.0  17.0
2  20.0  23.0  27.0
3  15.0  18.0  22.0
4  30.0  33.0  37.0

In [6]:
df.shift(2)

   Col1  Col2  Col3
0   NaN   NaN   NaN
1   NaN   NaN   NaN
2  10.0  13.0  17.0
3  20.0  23.0  27.0
4  15.0  18.0  22.0

In [7]:
df.shift(-1)

   Col1  Col2  Col3
0  20.0  23.0  27.0
1  15.0  18.0  22.0
2  30.0  33.0  37.0
3  45.0  48.0  52.0
4   NaN   NaN   NaN